In [26]:
import pandas as pd

In [27]:
# Mapear o caminho e nome do arquivo

path = 'C:\\Users\\FIC\\Documents\\Fabiana Python\\003 - Arquivos\\'
file = 'world_happiness_report_2015.csv'

#Alocar o documento em um Datafreme

df = pd.read_csv(path + file)

# Visualizar o cabeçalho dos dados

df.head()

,country,region,happiness rank,happiness score,standard error,economy (GDP per Capita),family,health (Life Expectancy),freedom,trust (Government Corruption),generosity,dystopia residual
0,Switzerland,Western Europe,1,7.587,0.03411,1.39651,1.34951,0.94143,0.66557,0.41978,0.29678,2.51738
1,Iceland,Western Europe,2,7.561,0.04884,1.30232,1.40223,0.94784,0.62877,0.14145,0.43630,2.70201
2,Denmark,Western Europe,3,7.527,0.03328,1.32548,1.36058,0.87464,0.64938,0.48357,0.34139,2.49204
3,Norway,Western Europe,4,7.522,0.03880,1.45900,1.33095,0.88521,0.66973,0.36503,0.34699,2.46531
4,Canada,North America,5,7.427,0.03553,1.32629,1.32261,0.90563,0.63297,0.32957,0.45811,2.45176

In [33]:
# b) Qual a média do score_felicidade?


media = df['happiness score'].mean()

# A função round trata a quantidade de numeros após a
round(media,3)

5.424

In [35]:
# c) Qual a soma do PIB?

df['economy (GDP per Capita)'].sum()

141.37172

In [30]:
# d) Qual a soma do freedom e corrupção?

df[['freedom','trust (Government Corruption)']].sum()

freedom                          71.33320
trust (Government Corruption)    24.59645
dtype: float64

In [39]:
# e) Há dados duplicados? 
df.duplicated()

0      False
1      False
2      False
3      False
4      False
       ...
159    False
160    False
161    False
162    False
163    False
Length: 164, dtype: bool

In [40]:
# Quantos? 
df.duplicated().sum()

6

In [41]:
# Verifique quais são eles?

df[df.duplicated()==True]

,country,region,happiness rank,happiness score,standard error,economy (GDP per Capita),family,health (Life Expectancy),freedom,trust (Government Corruption),generosity,dystopia residual
11,Canada,North America,5,7.427,0.03553,1.32629,1.32261,0.90563,0.63297,0.32957,0.45811,2.45176
12,Finland,Western Europe,6,7.406,0.03140,1.29025,1.31826,0.88911,0.64169,0.41372,0.23351,2.61955
13,Netherlands,Western Europe,7,7.378,0.02799,1.32944,1.28017,0.89284,0.61576,0.31814,0.47610,2.46570
14,Sweden,Western Europe,8,7.364,0.03157,1.33171,1.28907,0.91087,0.65980,0.43844,0.36262,2.37119
34,Oman,Middle East and Northern Africa,22,6.853,0.05335,1.36011,1.08182,0.76276,0.63274,0.32524,0.21542,2.47489
35,Venezuela,Latin America and Caribbean,23,6.810,0.06476,1.04424,1.25596,0.72052,0.42908,0.11069,0.05841,3.19131

In [42]:
# f) Verifique a quantidade de dados faltantes.

#exibir a quantidade de informações nulas nos campos da tabela

df.isnull().sum()

country                           0
region                            0
happiness rank                    0
happiness score                   8
standard error                    1
economy (GDP per Capita)          0
family                            0
health (Life Expectancy)          0
freedom                           0
trust (Government Corruption)     0
generosity                        0
dystopia residual                14
dtype: int64

### g) Crie um dataframe onde os valores faltantes de score_felicidade sejam substituídos por -9999.

In [43]:
# O comando df.loc esta selecionando todas as linhas (:) da coluna happiness score
# então os nulos são substituidos por -9999

df.loc[:,['happiness score']] = df.loc[:,['happiness score']].fillna(-9999)

df.isnull().sum()

country                           0
region                            0
happiness rank                    0
happiness score                   0
standard error                    1
economy (GDP per Capita)          0
family                            0
health (Life Expectancy)          0
freedom                           0
trust (Government Corruption)     0
generosity                        0
dystopia residual                14
dtype: int64

### h) Quantas e quais são as regiões existentes nos dados?

In [46]:
# Calcula a quantidade de registros duplicados

df.region.duplicated().sum()

154

In [47]:
# Remove as duplicadas e insere em um novo dataframe

df_region = df.region.drop_duplicates()

In [48]:
# Calcular a quantidade de regiões únicas

df.region.count()

164

In [50]:
# Quais são essas regioes

df_region

0                      Western Europe
4                       North America
8           Australia and New Zealand
10    Middle East and Northern Africa
15        Latin America and Caribbean
27                  Southeastern Asia
36         Central and Eastern Europe
43                       Eastern Asia
76                 Sub-Saharan Africa
84                      Southern Asia
Name: region, dtype: object

### i) Verifique a frequência dos dados segundo suas regiões. Qual a região com maior quantidade de dados? E a região com a menor quantidade?

In [51]:
df.region.value_counts()

region
Sub-Saharan Africa                 40
Central and Eastern Europe         29
Western Europe                     24
Latin America and Caribbean        23
Middle East and Northern Africa    21
Southeastern Asia                   9
Southern Asia                       7
Eastern Asia                        6
North America                       3
Australia and New Zealand           2
Name: count, dtype: int64

### Unir amostras de dados
Com o Pandas, temos alguns métodos para unir dados de datasets distintos, dentre
os quais podemos citar:

• concat: função que une os datasets ao longo de um eixo;

• merge: método que combina um ou mais datasets baseado em uma coluna em comum.

In [53]:
# --------------------------------------------------------------------------------Dataframe 01 - Exemplo

dados = {
         'ID':['1','2','3','4','5'],
         'nome':['Ana','Barbara','Douglas','Lorenzo','Enzo'],
         'sobrenome': ['Silva','Mourão','Souza','Lopes','Mendes']          
}

#Converter o dicionario em dataframe

df_1 = pd.DataFrame(dados,columns=['ID','nome','sobrenome'])


# --------------------------------------------------------------------------------Dataframe 02 - Exemplo

dados2 = {
         'ID':['6','7','8','9','10'],
         'nome':['Eder','Lucas','Joana','Paulo','Bete'],
         'sobrenome': ['Junqueira','Tarrou','Liza','oshio','yuho']          
}
df_2 = pd.DataFrame(dados2,columns=['ID','nome','sobrenome'])


# --------------------------------------------------------------------------------Dataframe 03 - Exemplo

notas = {
         'ID':['1','2','3','4','5','6','7','8','9','10'],
         'notas_id':['51','55','15','61','84','96','100','0','78','12']
}        

df_notas = pd.DataFrame(notas,columns =['ID','notas_id'])

In [54]:
df_1.head()

  ID     nome sobrenome
0  1      Ana     Silva
1  2  Barbara    Mourão
2  3  Douglas     Souza
3  4  Lorenzo     Lopes
4  5     Enzo    Mendes

In [55]:
df_2.head()

   ID   nome  sobrenome
0   6   Eder  Junqueira
1   7  Lucas     Tarrou
2   8  Joana       Liza
3   9  Paulo      oshio
4  10   Bete       yuho

In [56]:
df_notas.head()

  ID notas_id
0  1       51
1  2       55
2  3       15
3  4       61
4  5       84

#### Empilhar os dataframes 1 e 2

In [58]:

df_1_2 = pd.concat([df_1, df_2],ignore_index=True)

df_1_2

   ID     nome  sobrenome
0   1      Ana      Silva
1   2  Barbara     Mourão
2   3  Douglas      Souza
3   4  Lorenzo      Lopes
4   5     Enzo     Mendes
5   6     Eder  Junqueira
6   7    Lucas     Tarrou
7   8    Joana       Liza
8   9    Paulo      oshio
9  10     Bete       yuho

#### Realizar a associação do ID, NOME, SOBRENOME e NOTAS (MERGE)

In [59]:
df_final = pd.merge(df_1_2,df_notas,on='ID',how='left')

df_final

   ID     nome  sobrenome notas_id
0   1      Ana      Silva       51
1   2  Barbara     Mourão       55
2   3  Douglas      Souza       15
3   4  Lorenzo      Lopes       61
4   5     Enzo     Mendes       84
5   6     Eder  Junqueira       96
6   7    Lucas     Tarrou      100
7   8    Joana       Liza        0
8   9    Paulo      oshio       78
9  10     Bete       yuho       12